crossdict-gcide-help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Installing Dictionary Data Separately</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Installing Dictionary Data Separately"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-11 18:28:24 CST"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Installing Dictionary Data Separately</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 English version</a></li>
<li><a href="#sec-2">2 中文版本</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> English version</h2>
<div class="outline-text-2" id="text-1">


<p>
The CrossDict since version 2.0 will be released separately with the
dictionary data.
</p>
<p>
You can install the GCIDE dictionary data from <a href="https://play.google.com/store/apps/details?id=com.baohaojun.crossdictgcide">Google Play</a> directly,
or you can download it from <a href="http://vdisk.weibo.com/s/thlHF">Sina Vdisk</a> and install it manually if you
can't access Google Play.
</p>
<p>
The first time you run the CrossDictGcide dictionary data APK, it will
take some time to copy the data files to sdcard. Please wait
patiently. After it is finished, you can safely uninstall it to save
storage space.
</p>
<p>
It has 2 advantages arranged this way:
</p>
<ol>
<li>Ease of upgrading the dictionary software.

</li>
<li>Saving storage space by uninstalling the dictionary data APK.
</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 中文版本</h2>
<div class="outline-text-2" id="text-2">


<p>
CrossDict从2.0版开始将与其字典数据分开发布。
</p>
<p>
你可以从<a href="https://play.google.com/store/apps/details?id=com.baohaojun.crossdictgcide">Google Play</a>直接安装GCIDE字典数据，或者如果你不能使用Google
Play的话也可以从 <a href="http://vdisk.weibo.com/s/thlHF">新浪微盘</a> 上下载安装。
</p>
<p>
第一次运行这个字典数据APK的时候，它需要花一段时间（几十秒钟的样子）把数
据文件拷贝到sd卡上。请耐心等待。拷贝结束后，你可以安全的将此字典数据
APK从设备中卸载而不影响使用。
</p>
<p>
这样的安排有两个好处：
</p>
<ol>
<li>字典软件本身的升级变得更加方便。

</li>
<li>卸载字典数据APK可以节省存储空间。
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
